In [1]:
import pandas as pd

In [6]:
taxi = pd.read_csv('C:/Users/artyr/Desktop/Karpov_ML/2_taxi_nyc.csv')

In [9]:
taxi.head()

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0

pickup_dt – период с точностью до часа
pickup_month – месяц
borough – район Нью-Йорка, из которого был сделан заказ (5 районов + аэропорт)
pickups – число поездок за период (час)
hday – является ли день праздничным/выходным; Y - да,  N - нет
spd – скорость ветра в милях в час
vsb – видимость
temp – температура в градусах Фаренгейта
dewp – точка росы по Фаренгейту
slp – давление
pcp_01 – количество осадков за час
pcp_06 – количество осадков за 6 часов
pcp_24 – количество осадков за 24 часа
sd – глубина снега в дюймах

1. Проверьте, сколько всего строк и столбцов имеется в датасете.

In [8]:
taxi.shape

(29101, 14)

2. Какие типы колонок в датасете? Назовите преобладающий тип.

In [19]:
taxi.dtypes

pickup_dt        object
pickup_month     object
borough          object
pickups           int64
hday             object
spd             float64
vsb             float64
temp            float64
dewp            float64
slp             float64
pcp 01          float64
pcp 06          float64
pcp 24          float64
sd              float64
dtype: object

In [20]:
taxi.dtypes.value_counts()

float64    9
object     4
int64      1
dtype: int64

3. В названиях столбцов pcp 01, pcp 06, pcp 24 встречается пробел. Замените пробел в названиях на знак нижнего подчеркивания.

In [24]:
taxi = taxi.rename(columns={'pcp 01': 'pcp_01', 'pcp 06': 'pcp_06', 'pcp 24': 'pcp_24'})

In [25]:
taxi

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp_01,pcp_06,pcp_24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29096,2015-06-30 23:00:00,Jun,EWR,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29097,2015-06-30 23:00:00,Jun,Manhattan,3828,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29098,2015-06-30 23:00:00,Jun,Queens,580,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29099,2015-06-30 23:00:00,Jun,Staten Island,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29100,2015-06-30 23:00:00,Jun,NaN,3,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0

Альтернативный вариант:

In [ ]:
def underscore_rename(name):
    return name.replace(' ', '_')

In [ ]:
taxi.rename(columns=underscore_rename)

4. Сколько записей (строк) в датафрейме относятся к району Манхэттен (Manhattan)? Сколько раз в данных встречается район Бруклин (Brooklyn)?

In [26]:
taxi.query("borough == 'Manhattan'") \
    .shape[0]

4343

In [33]:
taxi.groupby('borough', as_index=False) \
    .aggregate({'hday': 'count'})

         borough  hday
0          Bronx  4343
1       Brooklyn  4343
2            EWR  4343
3      Manhattan  4343
4         Queens  4343
5  Staten Island  4343

In [28]:
taxi.borough.value_counts()

Bronx            4343
EWR              4343
Queens           4343
Manhattan        4343
Brooklyn         4343
Staten Island    4343
Name: borough, dtype: int64

5. Следующая задача: выяснить, из какого района было совершено наибольшее количество поездок за весь период. Для начала, посчитайте общее количество поездок (pickups), без группировки.

In [34]:
taxi.pickups.sum()

14265773

6. Сгруппируйте данные по району (borough) и укажите, из какого пункта было совершено больше всего поездок.

In [36]:
taxi.groupby('borough', as_index=False) \
    .aggregate({'pickups': 'max'})

         borough  pickups
0          Bronx      262
1       Brooklyn     2009
2            EWR        2
3      Manhattan     7883
4         Queens      831
5  Staten Island       13

7. Сохраните название района с наименьшим числом поездок в переменную min_pickups.

In [39]:
min_pickups = taxi.groupby('borough') \
    .aggregate({'pickups': 'sum'}) \
    .idxmin()

pickups    EWR
dtype: object

8. Сгруппируйте данные по двум признакам: району города и является ли день выходным (колонки borough и hday). Сравните среднее число поездок, и назовите районы, из которых по праздникам в среднем поступает больше заказов, чем в обычные дни.

In [42]:
taxi.groupby(['borough', 'hday']) \
    .aggregate({'pickups': 'mean'})

                        pickups
borough       hday
Bronx         N       50.771073
              Y       48.065868
Brooklyn      N      534.727969
              Y      527.011976
EWR           N        0.023467
              Y        0.041916
Manhattan     N     2401.302921
              Y     2035.928144
Queens        N      308.899904
              Y      320.730539
Staten Island N        1.606082
              Y        1.497006

В Нью-Арке и Куинсе по выходным дням поездок больше.

9. Для каждого района посчитайте число поездок по месяцам. Отсортируйте полученные значения по убыванию и сохраните результирующий датафрейм в pickups_by_mon_bor. Обратите внимание, что итоговый датасет должен состоять из 3-х колонок – pickup_month, borough, pickups.

In [52]:
pickups_by_mon_bor = taxi.groupby(['borough', 'pickup_month'], as_index=False) \
    .aggregate({'pickups': 'sum'}) \
    .sort_values('pickups', ascending=False)

In [53]:
pickups_by_mon_bor

          borough pickup_month  pickups
21      Manhattan          Jun  1995388
23      Manhattan          May  1888800
19      Manhattan          Feb  1718571
22      Manhattan          Mar  1661261
18      Manhattan          Apr  1648278
20      Manhattan          Jan  1455543
9        Brooklyn          Jun   482466
11       Brooklyn          May   476087
6        Brooklyn          Apr   378095
10       Brooklyn          Mar   346726
7        Brooklyn          Feb   328650
8        Brooklyn          Jan   309011
27         Queens          Jun   286311
29         Queens          May   275893
28         Queens          Mar   219561
24         Queens          Apr   216857
25         Queens          Feb   185695
26         Queens          Jan   159211
5           Bronx          May    53037
3           Bronx          Jun    49006
0           Bronx          Apr    34617
4           Bronx          Mar    32232
1           Bronx          Feb    28694
2           Bronx          Jan    22461
33  Staten Island          Jun     1673
35  Staten Island          May     1517
30  Staten Island          Apr     1068
34  Staten Island          Mar      975
31  Staten Island          Feb      903
32  Staten Island          Jan      821
15            EWR          Jun       29
17            EWR          May       27
16            EWR          Mar       14
13            EWR          Feb       14
14            EWR          Jan       11
12            EWR          Apr       10

10. Поскольку данные о поездках в Нью-Йорке, температура представлена в градусах Фаренгейта. Напишите функцию temp_to_celcius, которая получает на вход колонку с температурой в °F, и возвращает значения, переведенные в градусы Цельсия.

In [55]:
def temp_to_celcius(temp):
    return ((temp-32) * 5.0)/(9.0)

In [56]:
temp_to_celcius(taxi.temp)

0        -1.111111
1        -1.111111
2        -1.111111
3        -1.111111
4        -1.111111
           ...
29096    23.888889
29097    23.888889
29098    23.888889
29099    23.888889
29100    23.888889
Name: temp, Length: 29101, dtype: float64